#### FloorFace Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing floor face types (top or bottom)

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum FloorFace ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FloorFace ``` |

| Visual C++ |
| --- |
| ``` public enum class FloorFace ``` |

# Members

| Member name | Description |
| --- | --- |
| Top |  |
| Bottom |  |

# See Also

Autodesk.Revit.DB Namespace